Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
             + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.zip"
              + quiet         = "true"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/81571851371cc3a23bc28e4c06c367ad52a4c97daebb6b102a818fcfb06d099e.zip"
          + "timestamp" = "1769764058520090200"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/security-sendSecurityAlert"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "security-sendSecurityAlert"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "security-sendSecurityAlert-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ses:SendEmail"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ses:ap-southeast-3:997141225542:identity/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "security-sendSecurityAlert"
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "security-sendSecurityAlert-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "security-sendSecurityAlert"
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Logs and alerts of any Inspector/CodeGuru findings"
      + filename                       = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
      + function_name                  = "security-sendSecurityAlert"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GASPI_ADMIN_EMAIL" = "diantest2020@gmail.com"
              + "SES_SOURCE_EMAIL"  = "diantest2020@gmail.com"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "security/lambda/sendSecurityAlert",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.plan.json"
      + id                   = (known after apply)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
          + "timestamp" = "1769764059254503000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-dbsnp"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-dbsnp"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-dbsnp-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-dbsnp"
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/dbsnp",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip"
          + "timestamp" = "1769764063642050000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-gnomad"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-gnomad"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-gnomad-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-gnomad"
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/gnomad",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip"
          + "timestamp" = "1769764063722368000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-lookup"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-lookup"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-lookup-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-lookup"
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/6a864c8b95fa4fa3d39884f6550e823153cc0ee3c5eebe5b01162205b870ba1b.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6a864c8b95fa4fa3d39884f6550e823153cc0ee3c5eebe5b01162205b870ba1b.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/6a864c8b95fa4fa3d39884f6550e823153cc0ee3c5eebe5b01162205b870ba1b.zip"
          + "timestamp" = "1769764063639055000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-lookup-updateReferenceFiles"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-lookup-updateReferenceFiles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-lookup-updateReferenceFiles-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-lookup-updateReferenceFiles"
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-lookup-updateReferenceFiles-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-lookup-updateReferenceFiles"
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Updates the lookup reference files"
      + filename                       = "builds/888ed94286fdd40813b5bbfae1039c39a0a133bfc8c7abcba88db8306bc18e99.zip"
      + function_name                  = "pgxflow-backend-lookup-updateReferenceFiles"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/888ed94286fdd40813b5bbfae1039c39a0a133bfc8c7abcba88db8306bc18e99.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/888ed94286fdd40813b5bbfae1039c39a0a133bfc8c7abcba88db8306bc18e99.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/888ed94286fdd40813b5bbfae1039c39a0a133bfc8c7abcba88db8306bc18e99.zip"
          + "timestamp" = "1769764063719422200"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 1 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ap-southeast-3"
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "pgxflow-pharmcat-lambda-containers"
      + region               = "ap-southeast-3"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 1 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ap-southeast-3"
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "pgxflow-preprocessor-lambda-containers"
      + region               = "ap-southeast-3"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-pharmcat-gnomad"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-pharmcat-gnomad"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-pharmcat-gnomad-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-pharmcat-gnomad"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/gnomad",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.zip"
          + "timestamp" = "1769764063742354000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-pharmcat"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-pharmcat"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-pharmcat-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-pharmcat"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-postprocessor"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-postprocessor"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-postprocessor-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-postprocessor"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/postprocessor",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip"
          + "timestamp" = "1769764063827283000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-preprocessor"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-preprocessor"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-preprocessor-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-preprocessor"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/pgxflow-backend-pharmcat-updateReferenceFiles"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-pharmcat-updateReferenceFiles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-pharmcat-updateReferenceFiles-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-pharmcat-updateReferenceFiles"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-pharmcat-updateReferenceFiles-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-pharmcat-updateReferenceFiles"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Updates PharmCAT references and logs software versions"
      + filename                       = "builds/ccaa8157f3c620496c8603b80e4255df37adf3666234d8c1fa4a6f4ca1476806.zip"
      + function_name                  = "pgxflow-backend-pharmcat-updateReferenceFiles"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ccaa8157f3c620496c8603b80e4255df37adf3666234d8c1fa4a6f4ca1476806.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ccaa8157f3c620496c8603b80e4255df37adf3666234d8c1fa4a6f4ca1476806.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/ccaa8157f3c620496c8603b80e4255df37adf3666234d8c1fa4a6f4ca1476806.zip"
          + "timestamp" = "1769764063724412000"
        }
    }

Plan: 722 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.sbeacon.aws_dynamodb_table.project_users,
│   on sbeacon/dynamodb.tf line 69, in resource "aws_dynamodb_table" "project_users":
│   69: resource "aws_dynamodb_table" "project_users" {
│ 
│ range_key is deprecated. Use key_schema instead.
│ 
│ (and 9 more similar warnings elsewhere)
╵
╷
│ Error: Error pinging Docker server, please make sure that unix:///var/run/docker.sock is reachable and has a  '_ping' endpoint. Error: permission denied while trying to connect to the Docker daemon socket at unix:///var/run/docker.sock: Head "http://%2Fvar%2Frun%2Fdocker.sock/_ping": dial unix /var/run/docker.sock: connect: permission denied
│ 
│   with provider["registry.terraform.io/kreuzwerker/docker"],
│   on docker.tf line 3, in provider "docker":
│    3: provider "docker" {
│ 
╵
╷
│ Error: reading SES Email Identity (diantest2020@gmail.com) verification: couldn't find resource
│ 
│   with module.cognito.data.aws_ses_email_identity.ses_source_email,
│   on cognito/ses.tf line 1, in data "aws_ses_email_identity" "ses_source_email":
│    1: data "aws_ses_email_identity" "ses_source_email" {
│ 
╵
╷
│ Error: Error pinging Docker server, please make sure that unix:///var/run/docker.sock is reachable and has a  '_ping' endpoint. Error: permission denied while trying to connect to the Docker daemon socket at unix:///var/run/docker.sock: Head "http://%2Fvar%2Frun%2Fdocker.sock/_ping": dial unix /var/run/docker.sock: connect: permission denied
│ 
│   with module.sbeacon.provider["registry.terraform.io/kreuzwerker/docker"],
│   on sbeacon/docker_images.tf line 3, in provider "docker":
│    3: provider "docker" {
│ 
╵
╷
│ Error: reading SES Email Identity (diantest2020@gmail.com) verification: couldn't find resource
│ 
│   with module.security.data.aws_ses_email_identity.ses_source_email,
│   on security/ses.tf line 1, in data "aws_ses_email_identity" "ses_source_email":
│    1: data "aws_ses_email_identity" "ses_source_email" {
│ 
╵
❌ Terraform plan creation failed
❌ Terraform plan failed
❌ Main execution failed
ℹ️  ============================================================
ℹ️  SCRIPT EXECUTION SUMMARY
ℹ️  ============================================================
ℹ️  Environment: uat02
ℹ️  Operation: plan
ℹ️  Exit Code: 1
ℹ️  Duration: 909s
ℹ️  Timestamp: 2026-01-30T09:07:47Z
❌ Deployment failed. Check logs above for details.
ℹ️  Cleaning up sensitive files and configurations
ℹ️  Removing temporary files: *.out
✅ Cleanup completed
❌ Script failed with exit code: 1


```
</details>